# 多維陣列 N-Dimensional Array(簡稱ndarray)
# 建立陣列:
# 1.根據列表建立： 
# np.array([3, 5, 4])
# 2.建立資料未指定的一維陣列： 
# np.empty(3)
# 3.建立資料都是 0 的一維陣列： 
# np.zeros(3)
# 4.建立資料都是 1 的一維陣列： 
# np.ones(3)
# 5.建立連續資料的一維陣列： 
# np.arrange(10)

# 二維陣列:
# 1.根據列表建立(3x2)(各層有幾筆資料): 
# np.array([
#     [1,2], 
#     [3,2], 
#     [5,0]
# ])
# 2.建立資料未指定的二維陣列: 
# np.empty([3,2])
# 3.建立資料都是 0 的二維陣列: 
# np.zeros([3,2])
# 4.建立資料都是 1 的二維陣列: 
# np.ones([3,2])

# 三維陣列:
# 1.根據列表建立(2x2x3): 
# np.array([
#     [
#         [5,2,4], [1,2,8]
#     ], [
#         [3,8,2], [4,1,3]
#     ]
# ])
# 2.建立資料未指定的三維陣列: 
# np.empty([2, 2, 3])
# 3.建立資料都是 0 的三維陣列: 
# np.zeros([2, 2, 3])
# 4.建立資料都是 1 的三維陣列: 
# np.ones([2, 2, 3])

# 高維陣列: 需要完全以邏輯來推演
# 1x1x2x2:
# np.array([
#       [
#           [
#               [3,2],
#               [5,4]
#           ]
#       ]
# ])

# 練習:多維陣列的各種方式
# 載入 numpy 套件
import numpy as np
# # 建立一維陣列
# data = np.array([3, 2, 6, 4])
# print(data) # [3 2 6 4]
# data = np.empty(4) # 創造一個有四筆資料的一維陣列，資料未指定
# print(data) # [5.e-324 4.e-323 2.e-323 2.e-323]
# data = np.zeros(3)
# print(data) # [0. 0. 0.]浮點數 float
# data = np.ones(3)
# print(data) # [1. 1. 1.]浮點數 float
# data = np.arange(5) # 從 0 ~ 4 的連續整數
# print(data) # [0 1 2 3 4]

# 建立二維陣列
# data = np.array([ # 3x3
#     [2,3,2], 
#     [1,5,2],
#     [4,2,1]
# ])
# print(data) # [[2 3 2]
#             #  [1 5 2]
#             #  [4 2 1]]
# data = np.empty([3,3])
# print(data) # [[0.00e+000 0.00e+000 0.00e+000]
#             #  [0.00e+000 0.00e+000 3.32e-321]
#             #  [0.00e+000 0.00e+000 0.00e+000]]
# data = np.ones([2,3])
# print(data) # [[1. 1. 1.]
#             #  [1. 1. 1.]]

# 建立三維陣列
# data = np.array([ # 2x2x2
#     [
#         [3,1],[1,2]
#     ],
#     [
#         [2,5],[10,2]
#     ]
# ])
# print(data)
#             # [[[ 3  1]
#             #   [ 1  2]]

#             #  [[ 2  5]
#             #   [10  2]]]
# data = np.zeros([3,1,3])
# print(data)
#             # [[[0. 0. 0.]]

#             #  [[0. 0. 0.]]

#             #  [[0. 0. 0.]]]

# 建立高維陣列
# data = np.array([ # 1x1x2x3
#     [
#         [
#             [3,2,1],
#             [5,5,10]
#         ]
#     ]
# ])
# print(data)
#             # [[[[ 3  2  1]
#             #    [ 5  5 10]]]]
data = np.ones([2,1,1,2])
print(data)
            # [[[[1. 1.]]]


            #  [[[1. 1.]]]]
